app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 20 Nov 2013 13:23:58 UTC +00:00], ["description", ""], ["title", "Admin Controller Test"], ["updated_at", Wed, 20 Nov 2013 13:23:58 UTC +00:00]]