app/controllers/admin/comments_controller.rb

  def index
    if params[:post_id]
      redirect_to "/posts/#{params[:post_id]}#comments"
    else
      @comments = Comment.all
---
SELECT "comments".* FROM "comments"