app/controllers/admin/posts_controller.rb

UPDATE "posts" SET "title_image_file_name" = $1, "title_image_content_type" = $2, "title_image_file_size" = $3, "title_image_updated_at" = $4, "updated_at" = $5 WHERE "posts"."id" = 1
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "dashboard"]]
---
    def set_post
      @post = Post.unscoped.find(params[:id])