app/controllers/admin/series_controller.rb

  def index
    @series = Series.all
---
SELECT "series".* FROM "series"