app/views/admin/posts/_admin_posts.html.erb

  <td>
    <% post.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1  [["post_id", 2]]

  <td><% if post.series %><%= link_to post.series.title, post.series %><% end %></td>
  <td><%= post.comments.count %><%= plurality(" Comment", post.comments.count) %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]