app/views/posts/_posts_container.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
      <div class="post-comments" >
        <%= post.comments.count %> <%= plurality("Comment", post.comments.count) %>