app/views/posts/index.html.erb

    <div class="post-comments" >
      <%= post.comments.count %> Comments
---
SELECT "comments".id FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]