app/views/posts/show.html.erb

  <div class="comment-count" >
    <%= @post.comments.count %> Comments
---
SELECT "comments".id FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]