app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 08 Nov 2013 12:44:06 UTC +00:00], ["description", ""], ["title", "Indoor DIY"], ["updated_at", Fri, 08 Nov 2013 12:44:06 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save