app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("author", "body", "created_at", "email", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "post_id" = $1, "updated_at" = $2 WHERE "comments"."id" = 2  [["post_id", 1], ["updated_at", Wed, 13 Nov 2013 12:24:28 UTC +00:00]]