app/controllers/posts_controller.rb

  def index
    @q = Post.search(params[:q])
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "category_id", "created_at", "published", "published_date", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_post
      @post = Post.unscoped.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]