app/controllers/series_controller.rb

  def create
    @series = Series.new(series_params)

    respond_to do |format|
      if @series.save
---
INSERT INTO "series" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def set_series
      @series = Series.find(params[:id])
---
SELECT "series".* FROM "series" WHERE "series"."id" = $1 LIMIT 1  [["id", "1"]]