app/controllers/tags_controller.rb

INSERT INTO "tags" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 08 Nov 2013 12:10:49 UTC +00:00], ["description", ""], ["title", "fall"], ["updated_at", Fri, 08 Nov 2013 12:10:49 UTC +00:00]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_tag
      @tag = Tag.find(params[:id])