app/views/categories/show.html.erb

<p><%= @category.description %></p>
<% unless @category.posts.blank? %>
---
SELECT "posts".id FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]