app/views/series/show.html.erb

SELECT "posts".id FROM "posts" WHERE "posts"."series_id" = $1  [["series_id", 1]]
---
  <strong>Posts:</strong>
  <% @series.posts.each do |post| %>